Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalSupportCycleWarning Property
 Circular support chain detected
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AnalyticalSupportCycleWarning { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalSupportCycleWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AnalyticalSupportCycleWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace